Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--R_quickstart.tmx
Source language: en
Languages: ja

source: R Quickstart
ja: R クイック スタート

source: R is a free software environment for statistical computing and graphics.
ja: Rは、統計計算とグラフィックスのためのフリーソフトウェア環境です。

source: This Quick Start describes how to:
ja: このクイックスタートでは、次の方法について説明します。

source: use R for simple arithmetic
ja: 単純な算術演算には R を使用します。

source: load some data from a shapefile and map it
ja: シェープファイルからデータを読み込み、マップする

source: do a coordinate transformation
ja: 座標変換を行う

source: plot some data points on a map
ja: 地図上にいくつかのデータポイントをプロットする

source: Start R
ja: 開始 R

source: A full range of arithmetic, trigonometric, and statistical functions are built-in, and thousands more are available from packages in the `CRAN <https://cran.r-project.org/>`_ archive.
ja: 算術関数、三角関数、統計関数のすべてが組み込まれており、 `CRAN <https://cran.r-project.org/>`_ アーカイブのパッケージからさらに数千が利用可能です。

source: Building data
ja: データの構築

source: Loading map data
ja: マップ データの読み込み

source: This gives us a simple map of the world:
ja: これは私たちに世界の簡単な地図を与えます:

source: We add these points to the base map, scaling their size by scaled square root of the population (because that makes a symbol with area proportional to population), set the colour to red and the plotting character to a solid blob:
ja: これらのポイントをベースマップに追加し、人口のスケーリングされた平方根でサイズをスケーリングします（これにより、シンボルが人口に比例するようになるため）、色を赤に設定し、プロット文字を塗りつぶしたblobに設定します。

source: and our final image appears:
ja: そして最終的な画像が表示されます。

source: Vignettes
ja: ビネット

source: What next?
ja: 次のステップ

source: For general information about R, try the official `Introduction to R <https://cran.r-project.org/doc/manuals/R-intro.html>`_ or any of the documentation from the main `R Project <https://www.r-project.org/>`_ page.
ja: Rに関する一般的な情報については、公式の `Introduction to R <https://cran.r-project.org/doc/manuals/R-intro.html>`_ またはメインの `R Project <https://www.r-project.org/>`_ ページ。

source: For more information on spatial aspects of R, the best place to start is probably the `R Spatial Task View <https://cran.r-project.org/web/views/Spatial.html>`_
ja: Rの空間的側面の詳細については、おそらく「R Spatial Task View <https://cran.r-project.org/web/views/Spatial.html> `_から始めるのが最適です。

source: You might also want to check out the `R-Spatial <https://www.rspatial.org>`_ page.
ja: `R-Spatial <https://www.rspatial.org>`_ ページもチェックしてみてください。
